// Lab_02.cpp
// Чипігіна Анастасія
// Лабораторна робота № 2.
// Лінійні програми.
// Варіант 23

#include <iostream>
using namespace std;

int main()
{
    double a; // вхідний параметр
    double z1; // результат обчислення 1-го виразу
    double z2; // результат обчислення 2-го виразу

    cout << "a = "; cin >> a; // користувач вводить значення а
    
    // обчислення значення виразів за допомогою формул
    z1 = (sin(2*a)+sin(5*a)-sin(3*a))/(cos(a)+1-2*sin(2*a)*sin(2*a));
    z2 = 2 * sin(a);

   // виведення результатів обчислення
    cout << endl;
    cout << "z1 = " << z1 << endl;
    cout << "z2 = " << z2 << endl;

    system("pause");
    return 0;
}